[
    {
        "id": 1,
        "title": "Why I think Blockchain and Quantum can transform technological revolution",
        "date": "2025-02-03",
        "author": "Gharsa Amin",
        "tags": ["Computing", "Blockchain", "Quantum"],
        "content": "<p>Having spent the majority of my career in the blockchain and cryptocurrency space, I have a deeper love and connection to this space. In the coming years, we might see more applications of these technologies in real-world scenarios, from secure data transactions to more powerful computing systems.</p> <p>Blockchains currently have fundamental issues: Constantly getting targeted with cyber-threats. Inherent vulnerabilities exist within smart contracts, and the DeFi space. Many blockchains face scalability issues. The blockchain trilemma, where the difficulty of achieving decentralization, security, and scalability all at once is not possible, is a significant challenge. Interoperability is a very big issue, where hundreds of blockchain networks exist, but they often can't communicate with one another. I am planning to address interoperability, scalability, and cybersecurity-related issues when it comes to blockchain technologies. Using Post-Quantum Cryptography (PQC) for hedging against cybersecurity-related threats and vulnerabilities of smart contracts, while generating randomness within blockchain cryptography hashing, is needed.</p> <p>Main issues I found within blockchain technology: </p> <p>1) Blockchain technologies are not scalable enough for mass adoption. I have worked with different startups focused on blockchain technologies, and I have gained hands-on experience that scalability is a big concern. Interoperability, where different blockchains interact with each other, is a big problem—a problem that has not been addressed yet to the extent needed. I want to tackle this issue.</p> <p>2) More than 80% of the people in the blockchain space, based on my personal interactions, think that quantum is too far away, and they do not consider the intersection of quantum and blockchain.</p> <p>3) I think quantum needs to be more accessible to entrepreneurs for building, integration, and learning purposes. This is the main reason I want people to enter the blockchain and quantum spaces as entrepreneurs to observe things from a practical standpoint, where the focus is on creating, disrupting, and shipping products rather than on research and academia. This could lead to blockchain and quantum becoming more relevant and integrated into day-to-day workflows.</p> <p>More people getting onboarded to the blockchain ecosystem also means more data, more transactions. On-chain doesn’t have the capacity to take over all this data and still function without facing outages. What I am interested in exploring is the intersection of quantum and blockchain and how these two fields can support each other.</p> <p>Some Basic Quantum terms:</p> <p>Quantum algorithms: A quantum algorithm is an algorithm that can be executed on a quantum computer or the simulation of a quantum computer. Quantum algorithms use fundamental properties of quantum mechanics, such as superposition, interference, and quantum entanglement. The model for the quantum computer is usually a quantum circuit consisting of qubits, quantum gates, and quantum mechanical measurements. A quantum circuit uses qubits instead of bits. The state of a quantum bit is represented by a normalized state vector with two components. Several qubits are combined to form a quantum register. Quantum entanglement is when two particles link together in a certain way, no matter how far apart they are in space. When two particles become entangled, they can instantly affect each other's properties, no matter the distance between them. Entanglement is the backbone of quantum computing. It's what enables quantum bits, or qubits, to perform complex calculations at incredible speeds.</p> <p>This was an introduction to understanding the quantum and blockchain space better. We will dive deeper moving forward, focusing on software engineering!</p>"
    },
    {
        "id": 2,
        "title": "How to Build Beautiful, Responsive Websites with Tailwind CSS: Master Utility-First Design for Scalable Layouts",
        "date": "2025-02-28",
        "author": "Gharsa Amin",
        "tags": ["tailwindcss", "softwareengineering", "react", "bestofdev"],
        "content": "<p>Check out the full article on <a href=\"https://dev.to/gharsaamin/how-to-build-beautiful-responsive-websites-with-tailwind-css-master-utility-first-design-for-4am4\">https://dev.to/gharsaamin/how-to-build-beautiful-responsive-websites-with-tailwind-css-master-utility-first-design-for-4am4</a>.</p>"
    }

    
]
